import 'dart:io';

class Input {
  static inputMessage(String? msg) {
    var menu =
        '''-------------------------------------------------------------------------------------------------------------------------
[1] 상품 목록 보기 / [2] 장바구니에 담기 / [3] 장바구니에 담긴 상품, 총 가격 보기 / [4] 프로그램 종료 [6] 장바구니 초기화
-------------------------------------------------------------------------------------------------------------------------
''';
    stdout.write(msg ?? menu);
    String? input = stdin.readLineSync();
    return input;
  }
}
